In [1]:
from pandas import DataFrame, Series, DatetimeIndex
from datetime import datetime

In [2]:
s= Series([1,2,3,4], index=['a', 'b', 'c', 'd'])
print(s)

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [4]:
s.mean()

2.5

In [12]:
import random
data=[random.randint(0, 10000) for x in range(10000)]
#index=DatetimeIndex(start='01-01-2013', periods=len(data))
s=Series(data)
s

0       4095
1        269
2        625
3       9206
4       7407
        ...
9995    1725
9996    5353
9997    6464
9998    4136
9999    5712
Length: 10000, dtype: int64

In [14]:
data1=[random.randint(0, 10) for x in range (10)]
data2=[random.randint(11, 10000) for x in range (10)]

In [16]:
df=DataFrame({"first": data1, "second": data2})
df

   first  second
0      6    8539
1      0    6131
2      5    5901
3      3    9004
4      1    8265
5      2      11
6      2    4740
7      9    6677
8      2    2552
9      4    9000

In [18]:
df["sum"] = df["first"] + df["second"]
df

   first  second   sum
0      6    8539  8545
1      0    6131  6131
2      5    5901  5906
3      3    9004  9007
4      1    8265  8266
5      2      11    13
6      2    4740  4742
7      9    6677  6686
8      2    2552  2554
9      4    9000  9004

In [19]:
import vincent
from vincent.ipynb import init_d3, init_vg, display_vega

ModuleNotFoundError: No module named 'vincent'